cfd/OpenFOAM/incompressible/simpleFoam/Validation/NACA0012/system/include/controlVolume
// control volume dimensions
controlVolOriginX -2;
controlVolLength   8;
controlVolWidth    1;
controlVolHeight   4;

// cell size
controlVolCellSize 0.1;