cfd/OpenFOAM/incompressible/simpleFoam/Validation/NACA0012/system/include/refinementCylinder
// refinement cylinder coordinates
refinementCylinderCenter_x 0.0;
refinementCylinderCenter_y 0.0;
refinementCylinderCenter_z 0.0;

// refinement cylinder dimensions
refinementCylinderRadius 2.0;
refinementCylinderDepth  4.0;

// refinement level
regionRefinementLevel 2;
